In [1]:
import pandas as pd

Q.1

In [2]:
ps = pd.Series([4,8,15,16,23,42])

In [4]:
print(ps)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q.2

In [7]:
lst = ['srk', 'sr', 'kk', 34,53, 'num', 'char', 'var', 'int','object']

In [8]:
s = pd.Series(lst)

In [10]:
print(s)

0       srk
1        sr
2        kk
3        34
4        53
5       num
6      char
7       var
8       int
9    object
dtype: object

Q.3

In [16]:
df = pd.DataFrame({'Name': ['Alice', 'Bob','Claire'],
                   'Age':[25,30,27],
                   'Gender':['Female','Male','Female']})

In [17]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q.4

A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. It can also be thought of as a collection of two or more series with common indices.

A pandas series is a one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and values are the values stored on that index. It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data.

In [34]:
type(df) #dataframe

pandas.core.frame.DataFrame

In [36]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [37]:
srs = df['Name']

In [38]:
srs

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [35]:
type(srs)

pandas.core.series.Series

Q.5

There are many usefull functions in pandas such as
head()
tail()
read_csv()
fillna
dropna
describe
value_counts

In [39]:
df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [40]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [41]:
len(df)

3

In [43]:
df.drop('Gender', axis=1)

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

Q.6

In pandas library, both Series and DataFrame objects are mutable in nature. This means that you can modify the values of a Series or a DataFrame after it has been created.

For example, you can change the value of an element in a Series or a DataFrame by using the indexing operator and assigning a new value to it. You can also add or remove elements from a DataFrame using methods such as append() or drop().

Panel object is considered to be an immutable object. This means that you cannot modify the values of a Panel object once it has been created.

Q.5

In [73]:
s1 = pd.Series(['shimla', 'Chandigarh', 'delhi'])

In [74]:
s2 = pd.Series([3, 2, 1])

In [75]:
s3 = pd.Series([9, 8,9])

In [78]:
df1 = pd.DataFrame([s1,s2,s3], index=['city', 'tier', 'rating'])

In [80]:
df1.T

         city tier rating
0      shimla    3      9
1  Chandigarh    2      8
2       delhi    1      9